# $Id$
# 
# Copyright (c) 2011-12, Multiagent Team - Laboratoire Systemes et TransportseT)
# All rights reserved.
#
# This software is the confidential and proprietary information
# of the LabLaboratoire Systemes et Transportsfidential Information").
# You shall not disclose such Confidential Information and shall use
# it only in accordance with the terms of the license agreement
# you entered into with the SeT.
#
# http://www.multiagent.fr/

VALIDITY_NOT_CHECKED = E{0} : La validit\u00e9 de la primitive n''a pas \u00e9t\u00e9 test\u00e9e.
NO_STOP_POSITION = E{0} : La position de l''arr\u00eat de bus n''est pas initialis\u00e9e.
OUTSIDE_MAP_BOUNDS = E{0} : L''arr\u00eat de bus est en dehors des limites du r\u00e9seau routier : {1}.
STOP_NOT_IN_NETWORK = E{0}: L''arr\u00eat de bus n''est pas dans un r\u00e9seau de bus.
NO_STOP_IN_HUB = E{0} : Pas d''arr\u00eat de bus dans le p\u00f4le.
INVALID_LINKED_STOP = E{0} : L''arr\u00eat de bus associ\u00e9 est invalide : {1}.
NOT_IN_SAME_NETWORK = E{0} : Deux primitives sont dans des r\u00e9seaux de bus distincts.
HALT_NOT_IN_ITINERARY = E{0} : L''arr\u00eat d''itin\u00e9raire n''est pas dans un itin\u00e9raire.
NO_STOP_IN_HALT = E{0} : Aucun arr\u00eat de bus n''est associ\u00e9 \u00e0 cet arr\u00eat d''itin\u00e9raire.
HALT_NOT_ON_ROAD_SEGMENT = E{0} : L''arr\u00eat d''itin\u00e9raire n''est associ\u00e9 \u00e0 aucun segment de route.
INVALID_CURVILINE_POSITION = E{0} : La position curviligne "{1}" d''un arr\u00eat d''itin\u00e9raire sur le segment de route est invalide.
NO_ROAD_SEGMENT_IN_ITINERARY = E{0} : Aucun segment de route n''est associ\u00e9 \u00e0 l''itin\u00e9raire.
DISCONTINUOUS_PATH_IN_ITINERARY = E{0} : L''itin\u00e9raire est constitu\u00e9 d''un chemin discontinu de routes; {1} blocs distincts.
NOT_ENOUGH_VALID_BUS_HALTS = E{0} : Pas assez d''arr\u00eats d''itin\u00e9raire valides dans l''itin\u00e9raire.
INVALID_HALT_IN_ITINERARY = E{0} : L''itin\u00e9raire contient un arr\u00eat d''itin\u00e9raire invalide: {1}.
INVALID_HALT_ORDER = E{0} : L''ordre des arr\u00eats d''itin\u00e9raire est inconsistent : {1}.
UNUSED_ROAD_SEGMENT_BEYOND_TERMINUS = E{0}: L''itineraire contient un(des) segment(s) de route inutilis\u00e9(s) au del\u00e0 du terminus : {1}.
NO_ITINERARY_IN_LINE = E{0} : Aucun itin\u00e9raire dans la ligne de bus.
INVALID_ITINERARY_IN_LINE = E{0} : Itin\u00e9raire invalide dans la ligne de bus : {1}.
NOT_ENOUGH_VALID_BUS_STOPS = E{0} : Pas assez d''arr\u00eats de bus valides dans le r\u00e9seau de bus.
INVALID_STOP_IN_NETWORK = E{0} : Arr\u00eat de bus invalide dans le r\u00e9seau de bus.
INVALID_HUB_IN_NETWORK = E{0} : P\u00f4le invalide dans le r\u00e9seau de bus.
NO_LINE_IN_NETWORK = E{0} : Aucune ligne dans le r\u00e9seau de bus.
INVALID_LINE_IN_NETWORK = E{0} : Ligne invalide dans le r\u00e9seau de bus : {1}.
NO_BUS_NETWORK = E{0} : La primitive n''est pas dans un r\u00e9seau de bus.
NO_ROAD_NETWORK = E{0} : Le r\u00e9seau de bus n''est pas li\u00e9 \u00e0 un r\u00e9seau routier.
SEGMENT_OUTSIDE_ROAD_NETWORK = E{0} : Le segment de route est en dehors du r\u00e9seau de route associ\u00e9 au r\u00e9seau de bus : {1}.